yannan9918/STM32-Learning/Smart-Car/hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include <stdarg.h>
#include <string.h>
#include <stdio.h>
extern uint8_t RxData;
extern uint8_t RxFlag;
uint8_t MyArray[]={0x42,0x41,0x42,0x41};
extern char  Serial_RxPacket[100];
extern char Serial_TxPacket[100];
void Serial_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);//开启时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP;//复用推挽式输出
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);//初始化GPIO口
	
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;//复用推挽式输出
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);//初始化GPIO口
	
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate=9600;
	USART_InitStructure.USART_HardwareFlowControl=USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode=USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStructure.USART_Parity=USART_Parity_No;
	USART_InitStructure.USART_StopBits=USART_StopBits_1;
	USART_InitStructure.USART_WordLength=USART_WordLength_8b;
	USART_Init(USART1,&USART_InitStructure);
	
	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	USART_Cmd(USART1,ENABLE);
}

void Serial_SendByte(uint8_t Byte)
{
	USART_SendData(USART1,Byte);
	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==RESET);
	
}

void Serial_SendArray(uint8_t *Array,uint8_t Length)
{
	uint8_t i;
	for(i=0;i<Length;i++)
	{
	Serial_SendByte(Array[i]);
	}
}
void Serial_SendString(uint8_t *String)
{
	uint8_t i;
	for(i=0;String[i]!='\0';i++)
	{
	Serial_SendByte(String[i]);
	}
}
uint16_t Serial_Pow(uint8_t X,uint8_t Y)
{
	uint16_t Result=1;
   while(Y--)
   {
	Result=Result*X;
   }
	 return Result;
}
void Serial_SendNum(uint16_t Num,uint8_t Length)
{uint8_t i;
	for(i=0;i<Length;i++)
	{
	Serial_SendByte(Num/Serial_Pow(10,Length-i-1)%10+0x30);
	}
}

//int fputc(int ch, FILE *f)
//{
//	Serial_SendByte(ch);
//	return ch;
//}

void Serial_Printf(char *format, ...)
{
	char String[100];				
	va_list arg;			
	va_start(arg, format);			
	vsprintf(String, format, arg);	
	va_end(arg);					
	Serial_SendString(String);		
}
//uint8_t GetRxFlag(void)
//{
//	if(RxFlag==1)
//	{
//		RxFlag=0;
//		return 1;
//	}
//	else
//		return 0;
//}
void USART1_IRQHandler(void)
{
	static uint8_t RxState=0;
	static uint8_t pRxPacket=0;
	
	if(USART_GetITStatus(USART1, USART_IT_RXNE)==SET)
 {
	 RxData=USART_ReceiveData(USART1);
	if(RxState == 0)
	{
		if(RxData == '@' && RxFlag == 0)
		{
			RxState=1;
			pRxPacket=0;
		}
	}
	else if(RxState == 1)
	{
		if(RxData == '\r')
		{
			RxState=2;
			
		}
		else 
		{
			Serial_RxPacket[pRxPacket] = RxData;
			pRxPacket++;
		}
	}
	else if(RxState == 2)
	{
		if(RxData == '\n' )
		{
			RxState=0;
			Serial_RxPacket[pRxPacket] = '\0';
			RxFlag=1;
		}
	}
//	USART_ClearFlag(USART1, USART_FLAG_RXNE);
	USART_ClearITPendingBit(USART1, USART_IT_RXNE);
 }
}

void Serial_SendPacket(void)
{
	Serial_SendByte(0xff);
	Serial_SendArray(Serial_TxPacket,4);
	Serial_SendByte(0xFE);
}
